Revit 2026 API

# IFCDataCreateString Method

---

Creates a string data object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCData CreateString(
	string value
)
```
```vb
Public Shared Function CreateString (
	value As String
) As IFCData
```
```cpp
public:
static IFCData^ CreateString(
	String^ value
)
```
```fsharp
static member CreateString :
        value : string -> IFCData
```

#### Parameters

value String
     The string value.

#### Return Value

IFCData The IFCData object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace